[
  {
    "question": "Does Taste the Feeling perform Indie Rock music?",
    "answer": "Yes, Taste the Feeling performs Indie Rock music.",
    "context": "- Taste the Feeling is associated with the Indie Rock genre.",
    "question_type": "1-hop",
    "entities": [
      "Taste the Feeling",
      "Indie Rock"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Taste the Feeling'})-[:HAS_GENRE]->(g:Genre {name: 'Indie Rock'}) RETURN count(*) > 0"
  },
  {
    "question": "Which artists are signed to the same label as Start Over?",
    "answer": "Start Over is signed to Columbia, along with Frank Sinatra, Louis Tomlinson, Haim (ban nhạc).",
    "context": "- Start Over is signed to Columbia.\n- Other artists on Columbia include: Frank Sinatra, Louis Tomlinson, Haim (ban nhạc).",
    "question_type": "2-hop",
    "entities": [
      "Start Over",
      "Columbia",
      "Frank Sinatra",
      "Louis Tomlinson",
      "Haim (ban nhạc)"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Start Over'})-[:SIGNED_WITH]->(rl:RecordLabel)<-[:SIGNED_WITH]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What genre is the song hợp tácDrake và Young Jeezy by Just Whitney?",
    "answer": "The song hợp tácDrake và Young Jeezy by Just Whitney is Soul, as it appears on the Soul album Roman Reloaded.",
    "context": "- Just Whitney released the album Roman Reloaded.\n- The song hợp tácDrake và Young Jeezy is on the album Roman Reloaded.\n- The album Roman Reloaded is in the Soul genre.",
    "question_type": "3-hop",
    "entities": [
      "Just Whitney",
      "Roman Reloaded",
      "hợp tácDrake và Young Jeezy",
      "Soul"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Just Whitney'})-[:PERFORMS_ON]->(album:Album {title: 'Roman Reloaded'})<-[:PART_OF]-(s:Song {title: 'hợp tácDrake và Young Jeezy'}), (album)-[:HAS_GENRE]->(g:Genre) RETURN g.name"
  },
  {
    "question": "Which artists share the same genre as The Writing's on the Wall?",
    "answer": "Artists who share the Indie Rock genre with The Writing's on the Wall include Bottle It Up, The Christmas Song, Should've Said No.",
    "context": "- The Writing's on the Wall performs Indie Rock music.\n- Other Indie Rock artists include: Bottle It Up, The Christmas Song, Should've Said No.",
    "question_type": "2-hop",
    "entities": [
      "The Writing's on the Wall",
      "Indie Rock",
      "Bottle It Up",
      "The Christmas Song",
      "Should've Said No"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'The Writing's on the Wall'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What songs are on the album My Prerogative?",
    "answer": "The album My Prerogative contains songs including #\"My Prerogative\" (Dub) –, #\"My Prerogative\" (Extended remix) –, #\"My Prerogative\" (Edit) –, *12\" single, #\"My Prerogative\" (Instrumental) –.",
    "context": "- Album 'My Prerogative' includes songs: #\"My Prerogative\" (Dub) –, #\"My Prerogative\" (Extended remix) –, #\"My Prerogative\" (Edit) –, *12\" single, #\"My Prerogative\" (Instrumental) –.",
    "question_type": "1-hop",
    "entities": [
      "My Prerogative",
      "#\"My Prerogative\" (Dub) –",
      "#\"My Prerogative\" (Extended remix) –",
      "#\"My Prerogative\" (Edit) –",
      "*12\" single",
      "#\"My Prerogative\" (Instrumental) –"
    ],
    "cypher_query": "MATCH (s:Song)-[:PART_OF]->(album:Album {title: 'My Prerogative'}) RETURN s.title"
  },
  {
    "question": "Which artists share the same genre as The Many Ways?",
    "answer": "Artists who share the Heavy Metal genre with The Many Ways include Jennifer Lopez: Let's Get Loud, Fix You, John Denver.",
    "context": "- The Many Ways performs Heavy Metal music.\n- Other Heavy Metal artists include: Jennifer Lopez: Let's Get Loud, Fix You, John Denver.",
    "question_type": "2-hop",
    "entities": [
      "The Many Ways",
      "Heavy Metal",
      "Jennifer Lopez: Let's Get Loud",
      "Fix You",
      "John Denver"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'The Many Ways'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What genre is the song *Tuinfort by Just Whitney?",
    "answer": "The song *Tuinfort by Just Whitney is r&b, as it appears on the r&b album Roman Reloaded.",
    "context": "- Just Whitney released the album Roman Reloaded.\n- The song *Tuinfort is on the album Roman Reloaded.\n- The album Roman Reloaded is in the r&b genre.",
    "question_type": "3-hop",
    "entities": [
      "Just Whitney",
      "Roman Reloaded",
      "*Tuinfort",
      "r&b"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Just Whitney'})-[:PERFORMS_ON]->(album:Album {title: 'Roman Reloaded'})<-[:PART_OF]-(s:Song {title: '*Tuinfort'}), (album)-[:HAS_GENRE]->(g:Genre) RETURN g.name"
  },
  {
    "question": "Which artists are signed to the same label as Joe Jonas?",
    "answer": "Joe Jonas is signed to Columbia Records, along with The Neighbourhood, Paul Simon, Lay Up Under Me.",
    "context": "- Joe Jonas is signed to Columbia Records.\n- Other artists on Columbia Records include: The Neighbourhood, Paul Simon, Lay Up Under Me.",
    "question_type": "2-hop",
    "entities": [
      "Joe Jonas",
      "Columbia Records",
      "The Neighbourhood",
      "Paul Simon",
      "Lay Up Under Me"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Joe Jonas'})-[:SIGNED_WITH]->(rl:RecordLabel)<-[:SIGNED_WITH]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "Does Emmy Raver-Lampman perform Dance Pop music?",
    "answer": "Yes, Emmy Raver-Lampman performs Dance Pop music.",
    "context": "- Emmy Raver-Lampman is associated with the Dance Pop genre.",
    "question_type": "1-hop",
    "entities": [
      "Emmy Raver-Lampman",
      "Dance Pop"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Emmy Raver-Lampman'})-[:HAS_GENRE]->(g:Genre {name: 'Dance Pop'}) RETURN count(*) > 0"
  },
  {
    "question": "Which artists are signed to the same label as Zayn Malik?",
    "answer": "Zayn Malik is signed to Rca, along with The Shirelles, Paloma Faith, Kirstin Maldonado.",
    "context": "- Zayn Malik is signed to Rca.\n- Other artists on Rca include: The Shirelles, Paloma Faith, Kirstin Maldonado.",
    "question_type": "2-hop",
    "entities": [
      "Zayn Malik",
      "Rca",
      "The Shirelles",
      "Paloma Faith",
      "Kirstin Maldonado"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Zayn Malik'})-[:SIGNED_WITH]->(rl:RecordLabel)<-[:SIGNED_WITH]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "Who are the members of Que Sera, Sera (Whatever Will Be, Will Be)?",
    "answer": "The members of Que Sera, Sera (Whatever Will Be, Will Be) include Que Sera, Sera (Whatever Will Be, Will Be), Que Sera, Sera (Whatever Will Be, Will Be).",
    "context": "- Que Sera, Sera (Whatever Will Be, Will Be) has members: Que Sera, Sera (Whatever Will Be, Will Be), Que Sera, Sera (Whatever Will Be, Will Be).",
    "question_type": "1-hop",
    "entities": [
      "Que Sera, Sera (Whatever Will Be, Will Be)",
      "Que Sera, Sera (Whatever Will Be, Will Be)",
      "Que Sera, Sera (Whatever Will Be, Will Be)"
    ],
    "cypher_query": "MATCH (a:Artist)-[:MEMBER_OF]->(b:Band {name: 'Que Sera, Sera (Whatever Will Be, Will Be)'}) RETURN a.name"
  },
  {
    "question": "What albums did Don't Stop 'til You Get Enough release?",
    "answer": "Don't Stop 'til You Get Enough released albums including Blackout, Blackout, Blackout.",
    "context": "- Don't Stop 'til You Get Enough performed on albums: Blackout, Blackout, Blackout.",
    "question_type": "1-hop",
    "entities": [
      "Don't Stop 'til You Get Enough",
      "Blackout",
      "Blackout",
      "Blackout"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Don't Stop 'til You Get Enough'})-[:PERFORMS_ON]->(album:Album) RETURN album.title"
  },
  {
    "question": "Which artists are signed to the same label as The Blessed Unrest?",
    "answer": "The Blessed Unrest is signed to Epic, along with Como Ama una Mujer, Liam Gallagher, Michael Jackson's Vision.",
    "context": "- The Blessed Unrest is signed to Epic.\n- Other artists on Epic include: Como Ama una Mujer, Liam Gallagher, Michael Jackson's Vision.",
    "question_type": "2-hop",
    "entities": [
      "The Blessed Unrest",
      "Epic",
      "Como Ama una Mujer",
      "Liam Gallagher",
      "Michael Jackson's Vision"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'The Blessed Unrest'})-[:SIGNED_WITH]->(rl:RecordLabel)<-[:SIGNED_WITH]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "Does Kesha perform pop music?",
    "answer": "Yes, Kesha performs pop music.",
    "context": "- Kesha is associated with the pop genre.",
    "question_type": "1-hop",
    "entities": [
      "Kesha",
      "pop"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Kesha'})-[:HAS_GENRE]->(g:Genre {name: 'pop'}) RETURN count(*) > 0"
  },
  {
    "question": "Who are the members of Parachutes?",
    "answer": "The members of Parachutes include Parachutes, Parachutes.",
    "context": "- Parachutes has members: Parachutes, Parachutes.",
    "question_type": "1-hop",
    "entities": [
      "Parachutes",
      "Parachutes",
      "Parachutes"
    ],
    "cypher_query": "MATCH (a:Artist)-[:MEMBER_OF]->(b:Band {name: 'Parachutes'}) RETURN a.name"
  },
  {
    "question": "Does Bottle It Up perform Indie Pop music?",
    "answer": "Yes, Bottle It Up performs Indie Pop music.",
    "context": "- Bottle It Up is associated with the Indie Pop genre.",
    "question_type": "1-hop",
    "entities": [
      "Bottle It Up",
      "Indie Pop"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Bottle It Up'})-[:HAS_GENRE]->(g:Genre {name: 'Indie Pop'}) RETURN count(*) > 0"
  },
  {
    "question": "Does Rita Moreno perform Nhạc Dân Gian music?",
    "answer": "Yes, Rita Moreno performs Nhạc Dân Gian music.",
    "context": "- Rita Moreno is associated with the Nhạc Dân Gian genre.",
    "question_type": "1-hop",
    "entities": [
      "Rita Moreno",
      "Nhạc Dân Gian"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Rita Moreno'})-[:HAS_GENRE]->(g:Genre {name: 'Nhạc Dân Gian'}) RETURN count(*) > 0"
  },
  {
    "question": "What genre does Rascal Flatts perform?",
    "answer": "Rascal Flatts performs r&b.",
    "context": "- Rascal Flatts is associated with the r&b genre.",
    "question_type": "1-hop",
    "entities": [
      "Rascal Flatts",
      "r&b"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Rascal Flatts'})-[:HAS_GENRE]->(g:Genre) RETURN g.name"
  },
  {
    "question": "Which artists share the same genre as Benjamin Britten?",
    "answer": "Artists who share the Andrew genre with Benjamin Britten include Jenna Ushkowitz, Frank Sinatra.",
    "context": "- Benjamin Britten performs Andrew music.\n- Other Andrew artists include: Jenna Ushkowitz, Frank Sinatra.",
    "question_type": "2-hop",
    "entities": [
      "Benjamin Britten",
      "Andrew",
      "Jenna Ushkowitz",
      "Frank Sinatra"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Benjamin Britten'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What songs are on the album My Kind of Christmas?",
    "answer": "The album My Kind of Christmas contains songs including #\"These Are the Special Times\" –, Have Yourself a Merry Little Christmas, #\"Christmas Time\" –, #\"This Christmas\" –, #\"Merry Christmas, Baby\" –.",
    "context": "- Album 'My Kind of Christmas' includes songs: #\"These Are the Special Times\" –, Have Yourself a Merry Little Christmas, #\"Christmas Time\" –, #\"This Christmas\" –, #\"Merry Christmas, Baby\" –.",
    "question_type": "1-hop",
    "entities": [
      "My Kind of Christmas",
      "#\"These Are the Special Times\" –",
      "Have Yourself a Merry Little Christmas",
      "#\"Christmas Time\" –",
      "#\"This Christmas\" –",
      "#\"Merry Christmas, Baby\" –"
    ],
    "cypher_query": "MATCH (s:Song)-[:PART_OF]->(album:Album {title: 'My Kind of Christmas'}) RETURN s.title"
  },
  {
    "question": "What songs are on the album One of the Boys?",
    "answer": "The album One of the Boys contains songs including *Desmond Child, Manhattan Clique long edit, *Thiessen, Dr. Luke & Benny Blanco extended remix, * Sam Falson.",
    "context": "- Album 'One of the Boys' includes songs: *Desmond Child, Manhattan Clique long edit, *Thiessen, Dr. Luke & Benny Blanco extended remix, * Sam Falson.",
    "question_type": "1-hop",
    "entities": [
      "One of the Boys",
      "*Desmond Child",
      "Manhattan Clique long edit",
      "*Thiessen",
      "Dr. Luke & Benny Blanco extended remix",
      "* Sam Falson"
    ],
    "cypher_query": "MATCH (s:Song)-[:PART_OF]->(album:Album {title: 'One of the Boys'}) RETURN s.title"
  },
  {
    "question": "Does Rainey Qualley perform Hip Hop music?",
    "answer": "Yes, Rainey Qualley performs Hip Hop music.",
    "context": "- Rainey Qualley is associated with the Hip Hop genre.",
    "question_type": "1-hop",
    "entities": [
      "Rainey Qualley",
      "Hip Hop"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Rainey Qualley'})-[:HAS_GENRE]->(g:Genre {name: 'Hip Hop'}) RETURN count(*) > 0"
  },
  {
    "question": "Which artists share the same genre as Can You Feel the Love Tonight?",
    "answer": "Artists who share the Bubblegum Pop genre with Can You Feel the Love Tonight include Tina Knowles, Jamie Foxx.",
    "context": "- Can You Feel the Love Tonight performs Bubblegum Pop music.\n- Other Bubblegum Pop artists include: Tina Knowles, Jamie Foxx.",
    "question_type": "2-hop",
    "entities": [
      "Can You Feel the Love Tonight",
      "Bubblegum Pop",
      "Tina Knowles",
      "Jamie Foxx"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Can You Feel the Love Tonight'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What genre does Anything Could Happen perform?",
    "answer": "Anything Could Happen performs Pop Rock.",
    "context": "- Anything Could Happen is associated with the Pop Rock genre.",
    "question_type": "1-hop",
    "entities": [
      "Anything Could Happen",
      "Pop Rock"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Anything Could Happen'})-[:HAS_GENRE]->(g:Genre) RETURN g.name"
  },
  {
    "question": "Does Oops!... I Did It Again (bài hát) perform Alternative Rock music?",
    "answer": "Yes, Oops!... I Did It Again (bài hát) performs Alternative Rock music.",
    "context": "- Oops!... I Did It Again (bài hát) is associated with the Alternative Rock genre.",
    "question_type": "1-hop",
    "entities": [
      "Oops!... I Did It Again (bài hát)",
      "Alternative Rock"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Oops!... I Did It Again (bài hát)'})-[:HAS_GENRE]->(g:Genre {name: 'Alternative Rock'}) RETURN count(*) > 0"
  },
  {
    "question": "Which artists share the same genre as Lauv?",
    "answer": "Artists who share the Latin Pop genre with Lauv include Lucky Star (bài hát), Pete Wentz, Sweetener.",
    "context": "- Lauv performs Latin Pop music.\n- Other Latin Pop artists include: Lucky Star (bài hát), Pete Wentz, Sweetener.",
    "question_type": "2-hop",
    "entities": [
      "Lauv",
      "Latin Pop",
      "Lucky Star (bài hát)",
      "Pete Wentz",
      "Sweetener"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Lauv'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What genre is the song *Lukasz Gottwald by Just Whitney?",
    "answer": "The song *Lukasz Gottwald by Just Whitney is Dance Pop, as it appears on the Dance Pop album Roman Reloaded.",
    "context": "- Just Whitney released the album Roman Reloaded.\n- The song *Lukasz Gottwald is on the album Roman Reloaded.\n- The album Roman Reloaded is in the Dance Pop genre.",
    "question_type": "3-hop",
    "entities": [
      "Just Whitney",
      "Roman Reloaded",
      "*Lukasz Gottwald",
      "Dance Pop"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Just Whitney'})-[:PERFORMS_ON]->(album:Album {title: 'Roman Reloaded'})<-[:PART_OF]-(s:Song {title: '*Lukasz Gottwald'}), (album)-[:HAS_GENRE]->(g:Genre) RETURN g.name"
  },
  {
    "question": "Who are the members of My Chemical Romance?",
    "answer": "The members of My Chemical Romance include My Chemical Romance, My Chemical Romance.",
    "context": "- My Chemical Romance has members: My Chemical Romance, My Chemical Romance.",
    "question_type": "1-hop",
    "entities": [
      "My Chemical Romance",
      "My Chemical Romance",
      "My Chemical Romance"
    ],
    "cypher_query": "MATCH (a:Artist)-[:MEMBER_OF]->(b:Band {name: 'My Chemical Romance'}) RETURN a.name"
  },
  {
    "question": "Which artists share the same genre as At Last?",
    "answer": "Artists who share the Pop Rock genre with At Last include Aaron Copland, Scott McKenzie, Benny Goodman.",
    "context": "- At Last performs Pop Rock music.\n- Other Pop Rock artists include: Aaron Copland, Scott McKenzie, Benny Goodman.",
    "question_type": "2-hop",
    "entities": [
      "At Last",
      "Pop Rock",
      "Aaron Copland",
      "Scott McKenzie",
      "Benny Goodman"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'At Last'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What albums did No.6 Collaborations Project release?",
    "answer": "No.6 Collaborations Project released albums including Back to Basics, Back to Basics, Back to Basics.",
    "context": "- No.6 Collaborations Project performed on albums: Back to Basics, Back to Basics, Back to Basics.",
    "question_type": "1-hop",
    "entities": [
      "No.6 Collaborations Project",
      "Back to Basics",
      "Back to Basics",
      "Back to Basics"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'No.6 Collaborations Project'})-[:PERFORMS_ON]->(album:Album) RETURN album.title"
  },
  {
    "question": "Who are the members of Somewhere I Belong?",
    "answer": "The members of Somewhere I Belong include Somewhere I Belong, Somewhere I Belong.",
    "context": "- Somewhere I Belong has members: Somewhere I Belong, Somewhere I Belong.",
    "question_type": "1-hop",
    "entities": [
      "Somewhere I Belong",
      "Somewhere I Belong",
      "Somewhere I Belong"
    ],
    "cypher_query": "MATCH (a:Artist)-[:MEMBER_OF]->(b:Band {name: 'Somewhere I Belong'}) RETURN a.name"
  },
  {
    "question": "Who are the members of Danh sách bài hát thu âm bởi Linkin Park?",
    "answer": "The members of Danh sách bài hát thu âm bởi Linkin Park include Danh sách bài hát thu âm bởi Linkin Park, Danh sách bài hát thu âm bởi Linkin Park.",
    "context": "- Danh sách bài hát thu âm bởi Linkin Park has members: Danh sách bài hát thu âm bởi Linkin Park, Danh sách bài hát thu âm bởi Linkin Park.",
    "question_type": "1-hop",
    "entities": [
      "Danh sách bài hát thu âm bởi Linkin Park",
      "Danh sách bài hát thu âm bởi Linkin Park",
      "Danh sách bài hát thu âm bởi Linkin Park"
    ],
    "cypher_query": "MATCH (a:Artist)-[:MEMBER_OF]->(b:Band {name: 'Danh sách bài hát thu âm bởi Linkin Park'}) RETURN a.name"
  },
  {
    "question": "Does 3-Way (The Golden Rule) perform Alternative Rock music?",
    "answer": "Yes, 3-Way (The Golden Rule) performs Alternative Rock music.",
    "context": "- 3-Way (The Golden Rule) is associated with the Alternative Rock genre.",
    "question_type": "1-hop",
    "entities": [
      "3-Way (The Golden Rule)",
      "Alternative Rock"
    ],
    "cypher_query": "MATCH (a:Artist {name: '3-Way (The Golden Rule)'})-[:HAS_GENRE]->(g:Genre {name: 'Alternative Rock'}) RETURN count(*) > 0"
  },
  {
    "question": "Who are the members of Wings (ban nhạc)?",
    "answer": "The members of Wings (ban nhạc) include Wings (ban nhạc), Wings (ban nhạc).",
    "context": "- Wings (ban nhạc) has members: Wings (ban nhạc), Wings (ban nhạc).",
    "question_type": "1-hop",
    "entities": [
      "Wings (ban nhạc)",
      "Wings (ban nhạc)",
      "Wings (ban nhạc)"
    ],
    "cypher_query": "MATCH (a:Artist)-[:MEMBER_OF]->(b:Band {name: 'Wings (ban nhạc)'}) RETURN a.name"
  },
  {
    "question": "Which artists share the same genre as Just Be Free?",
    "answer": "Artists who share the Hip Hop genre with Just Be Free include Sam Smith, Scott McKenzie, Danh sách giải thưởng và đề cử của Amy Winehouse.",
    "context": "- Just Be Free performs Hip Hop music.\n- Other Hip Hop artists include: Sam Smith, Scott McKenzie, Danh sách giải thưởng và đề cử của Amy Winehouse.",
    "question_type": "2-hop",
    "entities": [
      "Just Be Free",
      "Hip Hop",
      "Sam Smith",
      "Scott McKenzie",
      "Danh sách giải thưởng và đề cử của Amy Winehouse"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Just Be Free'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  },
  {
    "question": "What genre is the song Carolina by Henry Purcell?",
    "answer": "The song Carolina by Henry Purcell is Pop Rockpoprock, as it appears on the Pop Rockpoprock album Kaleidoscope Heart.",
    "context": "- Henry Purcell released the album Kaleidoscope Heart.\n- The song Carolina is on the album Kaleidoscope Heart.\n- The album Kaleidoscope Heart is in the Pop Rockpoprock genre.",
    "question_type": "3-hop",
    "entities": [
      "Henry Purcell",
      "Kaleidoscope Heart",
      "Carolina",
      "Pop Rockpoprock"
    ],
    "cypher_query": "MATCH (a:Artist {name: 'Henry Purcell'})-[:PERFORMS_ON]->(album:Album {title: 'Kaleidoscope Heart'})<-[:PART_OF]-(s:Song {title: 'Carolina'}), (album)-[:HAS_GENRE]->(g:Genre) RETURN g.name"
  },
  {
    "question": "Which artists share the same genre as Christina Grimmie?",
    "answer": "Artists who share the Pop Rock genre with Christina Grimmie include Aaron Copland, Scott McKenzie, Benny Goodman.",
    "context": "- Christina Grimmie performs Pop Rock music.\n- Other Pop Rock artists include: Aaron Copland, Scott McKenzie, Benny Goodman.",
    "question_type": "2-hop",
    "entities": [
      "Christina Grimmie",
      "Pop Rock",
      "Aaron Copland",
      "Scott McKenzie",
      "Benny Goodman"
    ],
    "cypher_query": "MATCH (a1:Artist {name: 'Christina Grimmie'})-[:HAS_GENRE]->(g:Genre)<-[:HAS_GENRE]-(a2:Artist) WHERE a1 <> a2 RETURN a2.name"
  }
]